%通过待求节点及上下两侧节点求曲率
clear;
clc;
syms r;
%(1+y'^2)^(3/2)/y"
r = importdata("origin_data.txt");
X=zeros(size(r,1) - 2,3);
Y=zeros(size(r,1) - 2,3);

Y(:,1)=r(1:48,2);
Y(:,2)=r(2:49,2);
Y(:,3)=r(3:50,2);
X(:,1)=r(1:48,1);
X(:,2)=r(2:49,1);
X(:,3)=r(3:50,1);

a=zeros(size(r,1),1);
b=zeros(size(r,1),1);
c=zeros(size(r,1),1);
R=zeros(size(r,1),2);

R(:,1)=r(:,1);

for i=1:size(r,1) - 2
    a(i)=((X(i,1)-X(i,2))^2+(Y(i,1)-Y(i,2))^2);   % 1 2点间隔的平方
    b(i)=((X(i,1)-X(i,3))^2+(Y(i,1)-Y(i,3))^2);   % 1 3点间隔的平方
    c(i)=((X(i,2)-X(i,3))^2+(Y(i,2)-Y(i,3))^2);   % 2 3点间隔的平方
    % R(i)=1/(sqrt(((X(i,1)-X(i,2))^2+(Y(i,1)-Y(i,2))^2)*((X(i,1)-X(i,3))^2+(Y(i,1)-Y(i,3))^2)*((X(i,2)-X(i,3))^2+(Y(i,2)-Y(i,3))^2))/sqrt(4*((X(i,1)-X(i,3))^2+(Y(i,1)-Y(i,3))^2)*((X(i,2)-X(i,3))^2+(Y(i,2)-Y(i,3))^2)-(((X(i,1)-X(i,3))^2+(Y(i,1)-Y(i,3))^2)+((X(i,2)-X(i,3))^2+(Y(i,2)-Y(i,3))^2)-((X(i,1)-X(i,2))^2+(Y(i,1)-Y(i,2))^2))^2));
    R(i,2)=1/(sqrt(a(i)*b(i)*c(i))/sqrt(4*b(i)*c(i)-(b(i)+c(i)-a(i))^2));
end




